---
kind: type
id: T:Autodesk.Revit.DB.TableData
source: html/ab967e17-822e-fd5f-760a-4810e2e7eb61.htm
---
# Autodesk.Revit.DB.TableData

The TableData class is implemented to hold most of the data that describe
 the style of the rows, columns, and cells in a table.

## Syntax (C#)
```csharp
public class TableData : IDisposable
```